Tekla Open API Reference for Tekla Structures 2025
ConnectiveGeometry Constructor (Contour)
 Initializes a new instance of the ConnectiveGeometry class.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ConnectiveGeometry(
	Contour contour
)
Public Sub New (
	contour As Contour
)
Parameters
contour
Type: Tekla.Structures.Model.Contour
The polygon geometry
See Also
Reference
ConnectiveGeometry Class
ConnectiveGeometry Overload
Tekla.Structures.Model Namespace